artillery/postListing.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:9997
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
scenarios:
  - flow:
      - loop:
        - post:
            url: "/api/listing"
            json:
              propertyType: "an house"
              buildYear: 2055
              size: 150
              listingDescription: "description here"
              startingPrice: 2000
              buyoutPrice: 5000
              location: "Eindhoven"
              startsOn: "2024-07-22T21:23:33.000Z"
              endsOn: "2024-08-22T21:23:33.000Z"
            headers:
              authorization: "Bearer "
        count: 30